1week.org
*** 附加段（堆）

堆（HEAP）引出了ES寄存器，用来操作内存空间。
内存空间可以分为代码段、数据段、堆栈段、附加段三个部分。

为了更加方便的操作，引出了AX、BX、CX、DX四个通用寄存器。


加上用于存储计算机状态的Flag标志位寄存器，在8086 CPU上一共有14个寄存器。

- 4个数据寄存器(AX、BX、CX和DX)
- 2个变址和指针寄存器(SI和DI)
- 2个指针寄存器(SP和BP)
- 4个段寄存器(CS、SS、DS、ES)
- 1个指令指针寄存器(IP)
- 1个标志寄存器(EFlags)

*** 栈框

栈框就是指栈帧，一个函数运行时的栈空间，栈帧也叫过程活动记录。

ALGOL语言把堆栈分为7个部分。

#+BEGIN_SRC
|   .    |
|   .    |
|        |
|--------|
|  IN    | <- 输入数据
|--------|
|  OUT   | <- 输出数据
|--------|
| LOCAL  | <- 局部变量
|--------|
| TEMP   | <- 中间结果
|--------|
| SAVED  | <- 保存的机器状态
|--------|
| DATA   | <- 数据链
|--------|
| FUNC   | <- 函数（动态）链
|--------|
|        |
|   .    |
|   .    |
|        |
#+END_SRC

在C语言里，帧框中没有保留状态部分，没有数据链和函数链。

在SCHEME语言里，DATA和FUNC合二为一。

在尾递归中，帧框里的IN、OUT改变，不会增框。

** 9 LIST PROCESS FUNCTIONS

LIST PROCESS FUNCTIONS 指列表处理函数。

Racket中有两种非常重要的数据类型，列表和偶对。

并且在Racket中，有一系列函数用于列表处理。如：

- car cdar cddar
- cdr cadr

car用于取出列表的第一个元素，cdr用于取出列表中除去第一个元素，后面的元素组成的新列表。

list函数用于创建列表。

#+BEGIN_SRC racket
; '(1 2 3 4 5 6)
(list 1 2 3 4 5 6)
#+END_SRC

cons函数用于创造偶对。

#+BEGIN_SRC racket
; '(2 . 3)
(cons 2 3)

; '(2)
(cons 2 '())

; '(1 2 3)
(cons 1 '(2 3))
#+END_SRC

一些列表处理函数示例：

#+BEGIN_SRC racket
; '(1 2 3 4)
(append '(1 2) '(3 4))

; '(3 2 1)
(reverse '(1 2 3))
#+END_SRC

列表处理函数的原理都是对符号表进行操作。

完整的列表处理函数在安装Racket之后可以执行 =plt-help= 命令打开官方帮助文档查看。

** 10 DATABASE 

这个数据库指在Racket语言编程中，程序运行时，创建数据库。

在大型软件中，一个系统需要分解成模块来完成，使用模块化思想。这里有：

- mechanism 机制 
- function 功能

内部的机制和外在的功能一对概念。使用者不需要知道里面的机制，只需要知道功能。

内部的提供的机制通过数据库的形式组织起来。

在Racket中，数据库可以看做绑定（bound）的集合。

列表是最通用的容器，可以放很多的绑定（偶对）。 

在Racket有专门的列表，叫/alist/ （关联的列表），用来存放一个个偶对。
如： '((x . 200 (g . 200))) 。

可以看出来 /alist/ 就是一个数据库。

可以使用派发函数来操作数据库，五种操作：

- 增 INSERT
- 删 DELETE
- 改 MULATE
- 查 SEARCH
- 排序 SORT

有个 =assoc= 函数可以根据提供的标识符在 /alist/ 中查找偶对。

#+BEGIN_SRC racket
(define lst '((x 100) (y 100) (z (lambda () (* 10 10)))))
; '(x 100)
(assoc 'x lst)
#+END_SRC

*** 列表、偶对的结构

在LISP中，列表是偶对的嵌套。
计算的本质六大关系中的 泛导 -> 偶对，泛极 -> 测零。

#+BEGIN_SRC racket
> (list 1 2 3)
'(1 2 3)
> (cons 1 (cons 2 (cons 3 '())))
'(1 2 3)
> (cons 1 '(2 3))
'(1 2 3)
> (cons 1 (cons 2 3))
'(1 2 . 3)
#+END_SRC

从上面四个语句创建的数据，可以看出来，前三个语句创建的列表完全相同，为 '(1 2 3)。

我们看一下这个列表 '(1 2 3) 在内存中的结构：

#+BEGIN_SRC racket

+---+---+      +---+---+      +---+---+
|   |   +----> |   |   +----> |   |   +---> '()
+-+-+---+      +-+-+---+      +-+-+---+
  |              |              |
  +--> 1         +--> 2         +--> 3

#+END_SRC

而最后一个列表 '(1 2 . 3) 在内村中的结构如下：

#+BEGIN_SRC racket

+---+---+      +---+---+
|   |   +----> |   |   +----> 3
+-+-+---+      +-+-+---+
  |              |
  +--> 1         +--> 2

#+END_SRC

所以列表是由一个个嵌套的偶对组成的，而最后一个偶对的值是 '() ，可以忽略不写。

** 11 QUASI-QUOTATION

准引用能够将算式里的值计算后输出，符号 =`= （ESC下面的按键），区别于单引号 ' 。

示例：
#+BEGIN_SRC racket
; 引用
'(1 2 3)

; 准引用
`(1 2 3)

; '(1 3 3)
`(1 ,(+ 1 2) 3)

; '(1 (2 3) 4)
`(1 ,(list 2 3) 4)

; '(1 (2 3) (list 4 5))
`(1 ,(list 2 3) (list 4 5))

; '(1 2 3 (list 4 5))
`(1 ,@(list 2 3) (list 4 5))
#+END_SRC

准引用在宏（marco）中非常有用，用于符号计算。

** 12 EVALUATOR(REPL)

REPL指：
- READ 读取表达式
- EVALUATE 对读取的表达式求值
- PRINT 把求值的结果打印出来
- LOOP 循环

REPL就是LISP程序的基本流程。

求值的规则是LISP设计的关键，LISP核心是设计求值器。
说到求值的规则就回到了六大运算、八大规则。

求值器设计的核心就是 EVAL 函数： *(eval exp env)* 。

表达式的求值一定是在一个环境中，即 env 。

从哲学上来讲，对事物的评判一定是在一个限定的环境中，这是一个方法论，也是LISP的核心。

所以首先确定一个环境之后，再对需要的东西进行评估。

如何评判，首先看类型，比如：数字，偶对等，分类对策。

BNF范式就是用来定义类型系统的。

所以，在原有的派发函数基础上要加上一个环境，模型如图：
#+BEGIN_SRC

        eval
  +--------------+  <--- 外层环境
  |     env      |
  |   +-----+    |
  |   | exp |    |
  |   +-----+    |
  |    (alist) <-+--- 环境里有alist
  +--------------+

#+END_SRC

从闭包的角度，这就是两个闭包的嵌套。

环境里有个评判尺度，有alist存放数据，有增删改查排序5个操作，有cond函数分类对策，有派发函数来执行操作。

这就是LISP求值器设计的核心。
* Racket第四课

** 复习昨天的内容

LISP 就是 LIST PROCESSOR ，说到了Alist、assoc函数、QUASI-QUOTATION。

REPL的R、P是I/O部分，核心是 EVALUATOR 求值器。

求值器模型： /(eval exp env )/ ，首先根据类型分类对策， /env/ 环境中的数据用alist存放，相当于数据库。

** 求值器第二课

把求值器展开更详细的说明，可以分为阴阳两部分。
在太极中阳代表动， /eval/ 函数把表达式求值，则是阳的部分。
表达式的参数需要提前构造好，这个构造的过程是阴的过程。
求值器里使用 /(apply proc arg)/ 函数来把参数 arg 传递给 proc 。
/apply/ 执行的过程就是阴。

求值器是阴与阳的泛导，是不断的太极推手的过程，直到所有的复杂函数运算完毕。

在Racket的运行时系统中，光有堆不够用了。计算过程至少有4个参数：

- exp
- env
- proc
- argc

所以使用中，至少需要4个寄存器访问。

- 有一些中间计算结果 --> val寄存器
- 未完成 -> unev寄存器
- 还有跳转记录程序过程 -> continue寄存器

所以一共7个寄存器 + 堆栈 => 才能完成求值过程。

在Racket语言的内存中，帧框（栈帧）不一定是连在一起的，所以需要continue寄存器连接下一个帧框。

