1week.html

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> 二 AI ETHODOCOGY</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
AI问题解题的方法论，分为三个共同特点：
</p>

<ul class="org-ul">
<li>TARGET 问题的目标
</li>
<li>STATE 求解的过程、状态的变化、问题的转化
</li>
<li>OPERATE 操作
</li>
</ul>

<p>
这三点是解决所有AI问题所共同拥有的方面。
</p>

<p>
举个例子：一个老虎妈妈带着两个虎孩子和一个豹子要过河，豹子不能和虎孩子单独待在一起。
而过河的小船只能坐两只动物，并且只有虎妈妈才能划船，请问，它们该如何过河？
</p>

<p>
对于这个问题，就是排列组合（COMRINATION AERMMCATION），尝试找到成功的排列。
</p>

<p>
把人工智能可以分为3个层次，最底层是
</p>

<ul class="org-ul">
<li>查找与排序 SEARCH &amp; SORT
</li>
</ul>

<p>
但是当基数太大时，要避免组合爆炸。因此组合的复杂度不能是n的阶乘那样，几何增加，可以是n的平方、n的次方。
</p>

<p>
查找与排序 中，关键是降低复杂度，对问题空间进行聚类，商化。
</p>

<p>
第二层是：
</p>

<ul class="org-ul">
<li>建立模式 PATTERN 这是AI的核心。
</li>
</ul>

<p>
最上层就是应用：
</p>

<ul class="org-ul">
<li>应用 如：下棋、证明、机器学习、自然语言、图像识别等。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> 三 LISP与AI的关系</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
在 PM 1 2 3 理论中，可以通过集合、图（网）、矩阵来解决问题。
</p>

<p>
解决问题的模型如下：
</p>

<pre class="example">
+-----------+
|           | &lt;--- 构造解题空间
|  +-----+  |
|  |o o o|&lt;-+----- 问题空间
|  | o o |  |
|  +-----+  |
|           |
+-----------+
</pre>

<p>
如果用图，则可以把图进行商化，对子问题进行求解。
商化的子集里是个偏序结构。
问题组成一个TREE树结构，而TREE是LIST的嵌套，所以用LSIP语言来处理AI问题。
</p>
</div>
</div>

<div id="outline-container-sec-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> 四 CAE STUDIES</h4>
<div class="outline-text-4" id="text-6-2-4">
</div><ol class="org-ol"><li><a id="sec-6-2-4-1" name="sec-6-2-4-1"></a>自然语言处理<br  /><div class="outline-text-5" id="text-6-2-4-1">
<p>
对语言的处理不像处理数字那么简单。
</p>

<p>
比如： I READ A BOOK ==》 (READ I A.BOOK)
</p>

<p>
BOOK还有一些属性，如：
(BOOK ATTRIBUTES ((LENGTH THICK) (DIFFICUTY DIFF) (TOPIC A)))
</p>

<p>
这些属性是内节点。
</p>

<p>
如果这本书是我十年前读过的，那么这个描述是外节点：(READ I 10-YEARS-AGO)。
</p>

<p>
处理结构如下：
</p>

<pre class="example">
        +
        |
 +---------------+
 |      |        |
 v      v        v
READ    I    BOOK(...)    &lt;-- 内属性（PROPERTY）
                 +
                 |
          +------+---------+   &lt;-- 外属性（PROPERTY）
          |      |         |
          v      v         v
         READ    I    10-YEARS-AGO
</pre>

<p>
老的LISP里面有 PLIST 来存储这些数据，而Racket里面没有 PLIST 取而代之的是 ALIST。
</p>
</div>
</li>

<li><a id="sec-6-2-4-2" name="sec-6-2-4-2"></a>图像识别 GRAPH RECONGITION<br  /><div class="outline-text-5" id="text-6-2-4-2">
<p>
人眼就像两个 SENSORS （传感器），传递 SIGNALS （信号）给大脑。如果是用计算机处理这些信号，需要 A/D 转换。
</p>

<p>
比如人识别桌子的边角，大脑里面有对应的模式能够识别。如果用计算机处理，我们需要找到特征值。
可以把它变成线性代数问题，从而转化问题，解决问题。
</p>
</div>
</li>

<li><a id="sec-6-2-4-3" name="sec-6-2-4-3"></a>机器学习 MACHINE LEARNTING<br  /><div class="outline-text-5" id="text-6-2-4-3">
<p>
机器学习就是通过给予样本，让计算机自己学习，从中发现规律。
</p>

<p>
这就是一个不断积累的过程，把经验存放在集合里。
</p>
</div>
</li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: hexingpeng</p>
<p class="date">Created: 2016-11-23 三 19:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
